# GuidEnum Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
GuidEnum Constructor
GuidEnum Class See Also
---
Creates an Guid-based enum instance with the supplied name and GUID. GUID-based enum instance can be compared by this guid value.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public GuidEnum(
	Guid guid
)
```

Visual Basic
---
```text
Public Sub New ( _
	guid As Guid _
)
```

Visual C++
---
```text
public:
GuidEnum(
	Guid guid
)
```

# ### Parameters
guid
    Type: System..::..Guid The GUID of this GUID-based enum.
# See Also
GuidEnum Class
Autodesk.Revit.DB Namespace